## __Imputacion (Manejo de datos Faltantes)__

In [1]:
import pandas as pd
import os 
import numpy as np

In [2]:
ruta =  r'C:\Users\USUARIO\Documents\Python Scripts\ML\Scripts\DATA_TOOLS\PANDAS\clientes.csv'
ruta = ruta.replace(os.sep,'/')

In [3]:
data_clientes = pd.read_csv(ruta)

In [4]:
data_clientes

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

#### como identificar los datos faltantes ?

In [9]:
data_clientes[data_clientes['nombre'].isnull()]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [ ]:
data_clientes.dropna() ## Borrar los clientes con columnas nulas

In [12]:
## Escoger que columnas nulas para borrar
data_clientes.dropna(subset=['nombre','ingreso'])

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

#### Rellenar valores nulos

In [13]:
data_clientes.fillna(0)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        0  70.0  20000.0
3   Carmen  49.0  22000.0
4        0   0.0      0.0
5    Mario  30.0  15800.0
6    Pedro   0.0  17400.0
7  Gustavo  27.0      0.0
8   Carlos   0.0      0.0

In [15]:
data_clientes['nombre'].fillna('Desconocido')

0           Juan
1          Luisa
2    Desconocido
3         Carmen
4    Desconocido
5          Mario
6          Pedro
7        Gustavo
8         Carlos
Name: nombre, dtype: object

#### Reemplazar valores por defecto en el dataFrame

In [17]:
valores_default = {'nombre': 'Desconocido', 'edad': 18,'ingreso': 10000}

In [18]:
data_clientes.fillna(value=valores_default)

        nombre  edad  ingreso
0         Juan  35.0  15800.0
1        Luisa  25.0  17000.0
2  Desconocido  70.0  20000.0
3       Carmen  49.0  22000.0
4  Desconocido  18.0  10000.0
5        Mario  30.0  15800.0
6        Pedro  18.0  17400.0
7      Gustavo  27.0  10000.0
8       Carlos  18.0  10000.0

#### calculo de la moda, mediana, media para reemplazar valores faltantes

In [21]:
promedio = data_clientes['ingreso'].mean()
mediana = data_clientes['ingreso'].median()
moda = data_clientes['ingreso'].mode()[0] # ingresos que m√°s se repiten

In [22]:
print(promedio)
print(mediana)
print(moda)

18000.0
17200.0
15800.0